
===========================================================================
report_tns
============================================================================
tns -720.86

===========================================================================
report_wns
============================================================================
wns -5.79

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.79

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.15
