
===========================================================================
report_tns
============================================================================
tns -527.04

===========================================================================
report_wns
============================================================================
wns -5.31

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.31

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.15
