
===========================================================================
report_tns
============================================================================
tns -382.67

===========================================================================
report_wns
============================================================================
wns -7.31

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -7.31

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.18
