
===========================================================================
report_tns
============================================================================
tns -500.98

===========================================================================
report_wns
============================================================================
wns -5.61

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.61

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.22
