
===========================================================================
report_tns
============================================================================
tns -685.02

===========================================================================
report_wns
============================================================================
wns -5.25

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.25

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.17
