
===========================================================================
report_tns
============================================================================
tns -494.65

===========================================================================
report_wns
============================================================================
wns -4.23

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.23

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.17
