
===========================================================================
report_tns
============================================================================
tns -334.64

===========================================================================
report_wns
============================================================================
wns -4.71

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -4.71

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.22
