
===========================================================================
report_tns
============================================================================
tns -916.12

===========================================================================
report_wns
============================================================================
wns -6.25

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.25

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.14
