
===========================================================================
report_tns
============================================================================
tns -736.48

===========================================================================
report_wns
============================================================================
wns -8.64

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -8.64

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
