
===========================================================================
report_tns
============================================================================
tns -877.05

===========================================================================
report_wns
============================================================================
wns -6.25

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.25

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.17
