
===========================================================================
report_tns
============================================================================
tns -669.25

===========================================================================
report_wns
============================================================================
wns -6.47

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.47

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.23
